app/controllers/api/v1/survey_controller.rb

SELECT `surveys`.`id`, `surveys`.`title`, `surveys`.`description`, `surveys`.`price`, `surveys`.`status` FROM `surveys` WHERE `surveys`.`status` = 'global'
SELECT `surveys`.`id`, `surveys`.`title`, `surveys`.`description`, `surveys`.`price`, `surveys`.`status` FROM `surveys`
---
    def survey_list
      if params[:status] && params[:status] != 'all'
        surveys = Survey.select(:id, :title, :description, :price, :status).where(status: params[:status])
      else
        surveys = Survey.select(:id, :title, :description, :price, :status)

SELECT  `surveys`.* FROM `surveys` WHERE `surveys`.`id` = 0 LIMIT 1
---
    def survey
      survey = Survey.find(params[:id])