app/controllers/api/v1/task_controller.rb

SELECT `tasks`.`id`, `tasks`.`survey_id`, `tasks`.`taskname`, `tasks`.`description`, `tasks`.`price`, `tasks`.`status` FROM `tasks` WHERE `tasks`.`survey_id` = 1
---
    def task_list
      tasks = Task.select(:id, :survey_id, :taskname, :description, :price, :status).where(survey_id: params[:surveyId])