app/controllers/survey_controller.rb

SELECT `surveys`.`id`, `surveys`.`title`, `surveys`.`description`, `surveys`.`price`, `surveys`.`status` FROM `surveys` WHERE `surveys`.`status` = 'global'
SELECT `surveys`.`id`, `surveys`.`title`, `surveys`.`description`, `surveys`.`price`, `surveys`.`status` FROM `surveys`
---
  def list
    if params[:status] && params[:status] != 'all'
      @survey = Survey.select(:id, :title, :description, :price, :status).where(status: params[:status])
    else
      @survey = Survey.select(:id, :title, :description, :price, :status)

INSERT INTO `surveys` (`title`, `description`, `price`, `status`, `created_at`, `updated_at`) VALUES ('Test3', 'Test3', 400.0, 'completed', '2017-01-23 10:23:38', '2017-01-23 10:23:38')
---
  def create
    @survey = Survey.new(survey_params)

    if @survey.save

SELECT  `surveys`.* FROM `surveys` WHERE `surveys`.`id` = 1 LIMIT 1
---
  def show
    if params[:surveyId]
      @survey = Survey.find(params[:surveyId])

SELECT  `surveys`.* FROM `surveys` WHERE `surveys`.`id` = 1 LIMIT 1
---
  def edit
    @survey = Survey.find(params[:id])

SELECT  `surveys`.* FROM `surveys` WHERE `surveys`.`id` = 1 LIMIT 1
UPDATE `surveys` SET `title` = 'Test1', `description` = 'Test1', `updated_at` = '2017-01-23 10:18:30' WHERE `surveys`.`id` = 1
---
  def update
    @survey = Survey.find(params[:id])

    if @survey.update_attributes(survey_params)