app/controllers/task_controller.rb

  def list
    # @task = Task.where survey_id: params[:surveyId]
    @task = Task.select(:id, :survey_id, :taskname, :description, :price, :status).where(survey_id: params[:surveyId])
---
SELECT `tasks`.`id`, `tasks`.`survey_id`, `tasks`.`taskname`, `tasks`.`description`, `tasks`.`price`, `tasks`.`status` FROM `tasks` WHERE `tasks`.`survey_id` = 1